app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "image", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "831895039110"], ["LIMIT", 1]]
---
    def create
        @user = User.find_or_create_by(uid: auth['uid']) do |u|